
&НаКлиенте
Процедура РеквизитСостояниеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТекущееСостояние", РеквизитСостояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(РеквизитСостояние));
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитЗаказчикПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Заказчик", РеквизитЗаказчик, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(РеквизитЗаказчик));
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВодительПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Водитель", РеквизитВодитель, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(РеквизитВодитель));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("РБ_ДобавлениеЗаявокНаПеревозку")  Тогда
		
		РеквизитЗаказчик								= Справочники.Сотрудники.НайтиПоКоду(ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо.Код);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Заказчик", РеквизитЗаказчик, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(РеквизитЗаказчик));
		ЭтаФорма.Элементы.РеквизитЗаказчик.Доступность	= Ложь;
		
	КонецЕсли;
	    	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуГрупповогоСозданияЗаявок(Команда)
	ОткрытьФорму("Обработка.РБ_ГрупповоеСозданиеЗаявокНаПеревозку.Форма.Форма");
КонецПроцедуры
